---
kind: property
id: P:Autodesk.Revit.DB.SweptBlend.BottomProfile
source: html/398d3e23-022d-3784-baaa-5c7d8d7f2785.htm
---
# Autodesk.Revit.DB.SweptBlend.BottomProfile Property

The curves which make up the bottom profile of the sketch.

## Syntax (C#)
```csharp
public CurveArrArray BottomProfile { get; }
```

## Remarks
The indices of the curves in this array match the indices used in the vertex connection map.